app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @users = User.all
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)